
bot_menu = {'f0': ['Я Бот ИскуН. Чем могу помочь?', {'Поиск': 1, 'Просмотр': 2, 'Инфо': 3, 'Выход': 0}],
        'f1': ['Выберите параметр поиска', {'Пол': 11, 'Возраст': 12, 'Город': 13, 'Семейное положение': 14, 'Отмена': 0}],
        'f12': ['Введите возраст в интервале', {'20-29': 2, '30-39': 3, '40-49': 4, '50-59': 5, 'Все равно': 0}],
        'f13': ['Введите город', {'Все равно': 0}],
        'f11': ['Введите пол', {'Муж': 2, 'Жен': 1, 'Все равно': 0}],
        'f14': ['Введите семейное положение', {'Женат (замужем)': 4, 'Не женат (не замужем)': 1, 'Все равно': 0}],
        'f2': ['Смотреть', {'Туда': 1, 'Сюда': 2}],
        'f3': ['Информация', {'To': 1, 'Ce': 2}],
        'f5': ['Для ']}


def def_keyboard(menu, cur_pos, cur_keyboard):
    but_color = ['primary', 'secondary', 'positive', 'negative']
    cp = 'f' + str(cur_pos)
    if cp in menu.keys():
        pm = menu[cp]
        msg = pm[0]
        print(msg)
        i=0
        for kb in pm[1].keys():
            cur_keyboard.add_button(kb, color=but_color[i])
            i = i + 1
